; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v6)
		(pred_1 ?v2)
		(pred_4 ?v5)
		(pred_6 ?v5)
		(pred_5 ?v2 ?v5)
		(pred_2)
		(pred_3 ?v2))

   (:action op_3
       :parameters  (?v3 ?v1)
       :precondition (and (not-eq ?v3 ?v1) 
                          (pred_4 ?v3) (pred_4 ?v1) (pred_6 ?v3))
       :effect (and  (pred_6 ?v1)
		     (not (pred_6 ?v3))))


   (:action op_1
       :parameters (?v4 ?v8)
       :precondition  (and  (pred_1 ?v4) (pred_4 ?v8)
			    (pred_5 ?v4 ?v8) (pred_6 ?v8) (pred_2))
       :effect (and (pred_3 ?v4)
		    (not (pred_5 ?v4 ?v8)) 
		    (not (pred_2))))

   (:action op_2
       :parameters  (?v4  ?v8)
       :precondition  (and  (pred_1 ?v4) (pred_4 ?v8)
			    (pred_3 ?v4) (pred_6 ?v8))
       :effect (and (pred_5 ?v4 ?v8)
		    (pred_2)
		    (not (pred_3 ?v4)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_02 obj_05 obj_04 
          obj_01 obj_06 obj_03 
)
(:init
(pred_4 obj_02)
(pred_4 obj_05)
(pred_4 obj_04)
(pred_1 obj_01)
(pred_1 obj_06)
(pred_1 obj_03)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(pred_2)
(pred_5 obj_01 obj_04)
(pred_5 obj_06 obj_04)
(pred_5 obj_03 obj_02)
(pred_6 obj_04)
)
(:goal
(and
(pred_5 obj_01 obj_02)
(pred_5 obj_06 obj_04)
(pred_5 obj_03 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_01 obj_02) (pred_6 obj_05))
    (sometime-before  (pred_5 obj_03 obj_05) (pred_6 obj_04))
  )
)
)

; plan
1. (op_3 obj_04 obj_02)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_02)
   goals met: 1 of 3
2. (op_1 obj_03 obj_02)
   deleted: (pred_5 obj_03 obj_02) (pred_2)
   added: (pred_3 obj_03)
   goals met: 1 of 3
3. (op_3 obj_02 obj_05)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_05)
   goals met: 1 of 3
4. (op_2 obj_03 obj_05)
   deleted: (pred_3 obj_03)
   added: (pred_5 obj_03 obj_05) (pred_2)
   goals met: 2 of 3
5. (op_3 obj_05 obj_04)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_04)
   goals met: 2 of 3
6. (op_1 obj_01 obj_04)
   deleted: (pred_5 obj_01 obj_04) (pred_2)
   added: (pred_3 obj_01)
   goals met: 2 of 3
7. (op_3 obj_04 obj_02)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_02)
   goals met: 2 of 3
8. (op_2 obj_01 obj_02)
   deleted: (pred_3 obj_01)
   added: (pred_5 obj_01 obj_02) (pred_2)
   goals met: 3 of 3
